app/controllers/reservacions_controller.rb

SELECT "reservacions".* FROM "reservacions"
---
  def index
    @reservacions = Reservacion.all

INSERT INTO "reservacions" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-06-02 22:13:05.392374"], ["updated_at", "2014-06-02 22:13:05.392374"]]
SELECT  "tours".* FROM "tours"  WHERE "tours"."id" = ? LIMIT 1  [["id", "id_tour"]]
---
  def create
    @reservacion = Reservacion.new(reservacion_params)

    respond_to do |format|
      if @reservacion.save
        format.html { redirect_to @reservacion, notice: 'Reservacion was successfully created.' }
        format.json { render :show, status: :created, location: @reservacion }
        @tour = Tour.find(@reservacion.id_tour)