app/controllers/tours_controller.rb

SELECT "tours".* FROM "tours"
---
  def index
    @tours = Tour.all

INSERT INTO "tours" ("created_at", "cupo_disponible", "cupo_total", "fecha", "hora", "id_estado", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tour = Tour.new(tour_params)

    respond_to do |format|
      if @tour.save

SELECT  "tours".* FROM "tours"  WHERE "tours"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_tour
      @tour = Tour.find(params[:id])